In [1]:
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib
from scipy.stats import norm
from matplotlib import pyplot as plt

In [2]:
df = pd.read_csv('heights.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    20 non-null     object
 1   height  20 non-null     float64
dtypes: float64(1), object(1)
memory usage: 452.0+ bytes

In [5]:
#df.isna().sum()

In [6]:
df

       name  height
0     mohan     1.2
1     maria     2.3
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1
17    aamir    14.5
18      ken    23.2
19      Liu    40.2

In [7]:
df.describe()

          height
count  20.000000
mean    8.390000
std     8.782812
min     1.200000
25%     5.350000
50%     5.700000
75%     6.275000
max    40.200000

In [9]:
q1 = df['height'].quantile(0.25)
q3 = df['height'].quantile(0.75)
q1, q3

(5.3500000000000005, 6.275)

In [10]:
iqr = q3 - q1
iqr

0.9249999999999998

In [11]:
upper_bound = q1 - 1.5 * iqr
lower_bound = q3 + 1.5 * iqr
upper_bound, lower_bound

(3.962500000000001, 7.6625)

In [12]:
df[(df['height'] < upper_bound) | (df['height'] > lower_bound)]

     name  height
0   mohan     1.2
1   maria     2.3
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [15]:
df[(df.height > lower_bound)|(df.height < upper_bound)]

     name  height
0   mohan     1.2
1   maria     2.3
17  aamir    14.5
18    ken    23.2
19    Liu    40.2

In [18]:
no_outliers = df[(df['height'] > upper_bound) & (df['height'] < lower_bound)]
no_outliers

       name  height
2     sakib     4.9
3       tao     5.1
4     virat     5.2
5    khusbu     5.4
6    dmitry     5.5
7    selena     5.5
8      john     5.6
9     imran     5.6
10     jose     5.8
11  deepika     5.9
12   yoseph     6.0
13    binod     6.1
14  gulshan     6.2
15  johnson     6.5
16   donald     7.1